# ExportLinetypeInfo Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportLinetypeInfo Constructor
ExportLinetypeInfo Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExportLinetypeInfo()()()() | Constructs a new default ExportLinetypeInfo. |
| ExportLinetypeInfo(String) | Constructs a new ExportLinetypeInfo using the destination linetype name as input. |
| ExportLinetypeInfo(ExportLinetypeInfo) | Constructs a new copy of the input ExportLinetypeInfo object. |

# See Also
ExportLinetypeInfo Class
ExportLinetypeInfo Members
Autodesk.Revit.DB Namespace